---
type: HostObjAttributes
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# HostObjAttributes

`Autodesk.Revit.DB.HostObjAttributes` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetCompoundStructure | — | `public CompoundStructure GetCompoundStructure ()` |
| Method | SetCompoundStructure | — | `public void SetCompoundStructure ( CompoundStructure compoundStructure )` |
| Property | Parameter | — | `` |